tianyi86/STM32_ARM_Experiments/DMA控制器/USER/main.c
#include "stm32f4xx.h"
#include "delay.h" //简单延时
/***** 简单延时函数,ms,us *****/
void delay_us(uint16_t nus)
{
    uint16_t i;
    while(nus--)
    {
        i = 31; //秒表1分钟测试31
        while(i--);
    }
}

void delay_ms(uint16_t nms)
{
    uint16_t i;
    while(nms--)
    {
        i = 33800; //秒表1分钟测试33800
        while(i--);
    }
}
/*定义一帧数据，准备发送，\r\n代表回车换行，共两个字节*/
u8 SendBuf[] = "Hello Everyone!\r\n"; //全长17个字节
void USART2_Init(u32 baudrate);
void USART2_Init(u32 baudrate)
{
GPIO_InitTypeDef GPIO_InitStructure; //定义一个GPIO初始化用的结构体
USART_InitTypeDef USART_InitStructure; //定义一个串口初始化用的结构体

/*使能GPIOA和USART2时钟*/
RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE); //GPIOA在AHB1高速总线上
RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2,ENABLE); //USART2在APB1硬件总线上

/*USART2 GPIO配置*/
GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3; //USART2的IO
GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF; //复用模式
GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;//速度50MHz
GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //推挽复用输出
GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; //上拉电阻
GPIO_Init(GPIOA,&GPIO_InitStructure);

/*USART2 对应引脚复用映射*/
GPIO_PinAFConfig(GPIOA,GPIO_PinSource2,GPIO_AF_USART2); //映射PA2到USART2上使用
GPIO_PinAFConfig(GPIOA,GPIO_PinSource3,GPIO_AF_USART2); //映射PA3到USART2上使用

/*USART2 端口配置*/
USART_InitStructure.USART_BaudRate = baudrate; //波特率设置
USART_InitStructure.USART_WordLength = USART_WordLength_8b; //字长8bit
USART_InitStructure.USART_StopBits = USART_StopBits_1; //1停止位
USART_InitStructure.USART_Parity = USART_Parity_No; //无校验
USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; //收发
USART_Init(USART2, &USART_InitStructure); //使用上面的参数初始化USART2

USART_Cmd(USART2, ENABLE); //使能串口2
}
int main(void)
{
    DMA_InitTypeDef DMA_InitStruct;//定义 DMA 初始化结构体
    USART2_Init(115200); //串口2 初始化波特率115200

    USART_DMACmd(USART2,USART_DMAReq_Tx,ENABLE);  //使能串口2的DMA发送
    USART_DMACmd(USART2,USART_DMAReq_Rx,ENABLE);  //使能串口2的DMA接收

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1,ENABLE); //开启DMA1时钟

    /* 配置 DMA Stream */
    DMA_InitStruct.DMA_Channel = DMA_Channel_4;  //通道选择
    DMA_InitStruct.DMA_PeripheralBaseAddr = (u32)&USART2->DR;//外设地址串口2DR寄存器
    DMA_InitStruct.DMA_Memory0BaseAddr = (u32)SendBuf;//内存数组首地址
    DMA_InitStruct.DMA_DIR = DMA_DIR_MemoryToPeripheral;//内存→外设
    DMA_InitStruct.DMA_BufferSize = 17;//传输17字节
    DMA_InitStruct.DMA_PeripheralInc = DMA_PeripheralInc_Disable;//外设地址不增加
    DMA_InitStruct.DMA_MemoryInc = DMA_MemoryInc_Enable;//内存地址自增

    /* DMA其余参数 */
    DMA_InitStruct.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStruct.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStruct.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStruct.DMA_Priority = DMA_Priority_Medium;
    DMA_InitStruct.DMA_FIFOMode = DMA_FIFOMode_Disable;
    DMA_InitStruct.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
    DMA_InitStruct.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStruct.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_Init(DMA1_Stream6, &DMA_InitStruct);
    DMA_Cmd(DMA1_Stream6, ENABLE);    //启动DMA发送

    //主循环无任务，CPU空闲
    while(1)
    {

    }
}